```
terraform apply  

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # artifactory_group.main_group will be created
  + resource "artifactory_group" "main_group" {
      + admin_privileges = false
      + auto_join        = (known after apply)
      + id               = (known after apply)
      + name             = "test-group"
      + policy_manager   = false
      + realm            = (known after apply)
      + reports_manager  = false
      + watch_manager    = false
    }

  # artifactory_permission_target.main_group_permission_target will be created
  + resource "artifactory_permission_target" "main_group_permission_target" {
      + id   = (known after apply)
      + name = "test-group-permissions"

      + build {
          + includes_pattern = [
              + "**",
            ]
          + repositories     = [
              + "artifactory-build-info",
            ]

          + actions {
              + groups {
                  + name        = "test-group"
                  + permissions = [
                      + "annotate",
                      + "read",
                      + "write",
                    ]
                }
            }
        }

      + repo {
          + includes_pattern = [
              + "**",
            ]
          + repositories     = [
              + "maven-central-remote",
            ]

          + actions {
              + groups {
                  + name        = "test-group"
                  + permissions = [
                      + "annotate",
                      + "read",
                      + "write",
                    ]
                }
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

artifactory_group.main_group: Creating...
artifactory_group.main_group: Creation complete after 0s [id=test-group]
artifactory_permission_target.main_group_permission_target: Creating...
artifactory_permission_target.main_group_permission_target: Creation complete after 0s [id=test-group-permissions]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
